
!-------------------------------------------------------¬
!         Расчетные атмосферные условия                 ¦
!       Вероятностная стандартная атмосфера ( ВСА )     ¦
!--------------------------------------------------------
	SUBROUTINE RATU (
     1  T0, !<- Температура на уровне моря, К | input
     2  H , !<- геометрическая высота, м      |
     3  TH, !<- Температура на высоте ,K    | output
     4  PH, !<- давление на высоте, Па      |
     5  DP, !<- PH / PH0                    |
     6  RO, !<- плотность, кг/м^3           |
     7  CS) ! - скорость звука ,м/с         |

	implicit real*8 (a-h,o-z)
	Parameter (PH0=101325.d0, RA=287.0d0)
	REAL*8:: T01(13)=(/205., 229., 236., 243., 253., 265., 288.15,
     >        300., 302., 305., 307., 310., 331./ )

	REAL*8:: H1(4)=(/ 0, 1500, 11000, 17000/)

	REAL*8:: THX(13,4)

	open (2,file="ratu_data")
	do j=1,4
			read (2,*) (THX(i,j),i=1,13)
	end do
	close (2)


!	IF( H.gt.H1(4) .OR. H.lt.H1(1) .OR.
!     >   T0.lt.T01(1) .OR. T0.gt.T01(13) )
!     >   write(6,100) T0, H
!100	format(' RATU: Warning! Экстраполяция BCA: T0=',g11.5, bla-bla-bla T0,' H=',H
!----------    added 20.08.97   -------------------------
!	h=h_
!	if( H_.gt.h1(4) ) h=h1(4)
!	if( H_.lt.h1(1) ) h=h1(1)
!--------------------------------------------------------	
	IF (H.LE.11000.) THEN
	   DP = ((288.15d0-0.0065d0*H)/288.15d0)**5.2553d0
	ELSE
	   DP = 0.223184d0*dEXP((11000.d0-H)/6318.d0)
	END IF
	PH = PH0 * DP

	key1=12
	do while ( (t0.lt.t01(key1)) .and. (key1.gt.1))
	  key1=key1-1
	end do

	key2=3
	do while ( (h .lt. h1(key2)) .and. (key2.gt.1))
	  key2=key2-1
	end do

	X1 = (T0-T01(key1))/(T01(key1+1)-T01(key1))
	X2 = (H - H1(key2))/( H1(key2+1)- H1(key2))
	TH = ((1.-X1)*(1.-X2)*THX(key1  ,key2  )) +
     1     ((1.-X1)*    X2 *THX(key1  ,key2+1)) +
     2     (    X1 *(1.-X2)*THX(key1+1,key2  )) +
     3     (    X1 *    X2 *THX(key1+1,key2+1))

	TEX = TH * 1.8d0
      CpA = ((((((1.011554d-25*TEX-1.452677d-21)*TEX+7.6215767d-18)
     >      *TEX-1.5128259d-14)*TEX-6.7178376d-12)*TEX+6.5519486d-08)
     >      *TEX-5.1536879d-05)*TEX+2.5020051d-01
	CpA = CPA*4185.7666d0
	aK  = CPA/(CPA-RA)
	CS  = dSQRT(AK*RA*TH)
	RO  = PH/(TH*RA)

	return
	end
